DELETE FROM user_roles;
DELETE FROM users;
DELETE FROM meals;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (date_time, description, calories, user_id)
VALUES ('2020-01-30 10:00:00', 'Завтрак пользователя', 400, 100000),
       ('2020-01-30 13:00:00', 'Обед пользователя', 800, 100000),
       ('2020-01-30 20:00:00', 'Ужин пользователя', 1000, 100000),
       ('2020-01-31 0:00:00', 'Еда на граничное значение пользователя', 1500, 100000),
       ('2020-01-31 10:00:00', 'Второй завтрак ползователя', 700, 100000),
       ('2020-01-31 13:00:00', 'Второй обед пользователя', 1000, 100000),
       ('2020-01-31 20:00:00', 'Второй ужин пользователя', 500, 100000),
       ('2020-01-31 10:00:00', 'Завтрак админа', 600, 100001),
       ('2020-01-31 15:00:00', 'Обед админа', 1000, 100001),
       ('2020-01-31 21:00:00', 'Ужин админа', 900, 100001);